Revit 2027 API
RebarShapeDefinitionBySegments.GetSegment Method
 Return a reference to one of the segments in the definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeSegment GetSegment(
	int segmentIndex
)
Public Function GetSegment (
	segmentIndex As Integer
) As RebarShapeSegment
public:
RebarShapeSegment^ GetSegment(
	int segmentIndex
)
member GetSegment :
        segmentIndex : int -> RebarShapeSegment
Parameters
segmentIndex Int32
 Index of the segment (0 to NumberOfSegments - 1).
Return Value
RebarShapeSegment
 The requested segment.
Exceptions
Exception | Condition
ArgumentException |  segmentIndex is not between 0 and NumberOfSegments.
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace